app/controllers/avoirs_controller.rb

SELECT * FROM `applications` WHERE (`applications`.`id` = 3)
SELECT * FROM `avoirs` WHERE (`avoirs`.`id` = 8662)
SELECT * FROM `avoirs` WHERE (`avoirs`.`application_id` = 3) ORDER BY fichiercompression_id desc LIMIT 0, 10
SELECT * FROM `fichiercompressions` WHERE (`fichiercompressions`.`id` = 474)
SELECT count(*) AS count_all FROM `avoirs` WHERE (`avoirs`.`application_id` = 3)
---
  def show
    @compteur = 0
    @chemin = CHEMIN
    @application_id = Avoir.find(params[:id]).application_id
    @avoirs = Avoir.paginate(:per_page=>ByPage.new("fichiercompressions").page, :page => params[:page], :conditions=>{:application_id=>@application_id}, :order=>"fichiercompression_id desc", :joins=>[:fichiercompression])