app/controllers/fichiercompressions_controller.rb

  def editfilepublic
	require "net/ftp"
	@proportionmap = YAML::load_file(CONF_PATH)
	sessionfiledb = SessionFileDB.new
	fichiercompression = Fichiercompression.find(params[:id])
---
SELECT * FROM `fichiercompressions` WHERE (`fichiercompressions`.`id` = 474)

  def set_version_apps
  	@user_session = UserSession.new(params[:users])

	if @user_session.save
		if params[:fichiercompression][:file_file_name].nil? || params[:fichiercompression_avoir][:application_id].nil? || params[:fichiercompression][:currentversion].nil?
			render :text=>0
		else
			user = User.find(:first, :conditions=>{:username=>params[:users][:username]})
---
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1