app/controllers/javascript_controller.rb

	def snatch_close_window
		#Rails.logger.info "fichiercompression_id-=-=-=-=-=-=-=-=-=-#{params[:fichiercompression_id]}-=-=-=-=-=-=-=-"

		ftp = Net::FTP.new(CONFIG_FTP["identifiant"]["hostname"],CONFIG_FTP["identifiant"]["username"],CONFIG_FTP["identifiant"]["password"])
			fichiercompression = Fichiercompression.find(params[:fichiercompression_id].to_i)
---
SELECT * FROM `fichiercompressions` WHERE (`fichiercompressions`.`id` = 474)